[
    {
        "title": "Shahadat",
        "translations": [
            {
                "lang": "en",
                "title": "☝️ Shahadat",
                "sub_title": "The declaration of faith in Islam.",
                "desc": "Shahadat (Shahada) is the testimony that 'There is no god but Allah, and Muhammad ﷺ is His Messenger.' It is the first pillar of Islam and the foundation of a Muslim's belief."
            },
            {
                "lang": "ml",
                "title": "☝️ ഷഹാദത്ത്",
                "sub_title": "ഇസ്ലാമിലെ വിശ്വാസത്തിന്റെ സാക്ഷ്യവാക്ക്.",
                "desc": "ഷഹാദത്ത് എന്നാണ് 'അല്ലാഹു ഒഴികെ ആരാധിക്കപ്പെടേണ്ട മറ്റൊരുവൻ ഇല്ല, മുഹമ്മദ് ﷺ അല്ലാഹുവിന്റെ ദൂതനാണ്' എന്ന് സാക്ഷ്യം പറയുന്നത്. ഇത് ഇസ്ലാമിന്റെ ആദ്യത്തെ തൂണും ഒരു മുസ്ലിമിന്റെ വിശ്വാസത്തിന്റെ അടിസ്ഥാനവുമാണ്."
            }
        ]
    },
    {
        "title": "Salat",
        "is_primary": true,
        "translations": [
            {
                "lang": "en",
                "title": "🤲 Prayer",
                "sub_title": "Prayer is the pillar of Islam.",
                "desc": "Niskaram (Salah) is the daily prayer that connects a believer with Allah. It is performed five times a day at prescribed times and is considered the foundation of a Muslim’s faith and practice."
            },
            {
                "lang": "ml",
                "title": "🤲 നിസ്കാരം",
                "sub_title": "ഇസ്ലാമിന്റെ തൂണുകളിലൊന്നാണ് നിസ്കാരം.",
                "desc": "നിസ്കാരം (സലാഹ്) അല്ലാഹുവിനോടുള്ള ബന്ധം ശക്തിപ്പെടുത്തുന്ന ദിനേന ചെയ്തിരിക്കേണ്ട ആരാധനയാണ്. ദിവസത്തിൽ അഞ്ച് പ്രാവശ്യം നിർദ്ദിഷ്ട സമയങ്ങളിൽ നടത്തേണ്ടത് മുസ്ലിം ജീവിതത്തിന്റെ അടിസ്ഥാനഘടകമാണ്."
            }
        ]
    },
    {
        "title": "Zakath",
        "translations": [
            {
                "lang": "en",
                "title": "💰 Zakath",
                "sub_title": "Charity and purification of wealth.",
                "desc": "Zakath is one of the five pillars of Islam. It is an obligation for every eligible Muslim to give a fixed portion of their wealth to the poor and needy. Zakath purifies wealth, reduces inequality, and helps build a caring society."
            },
            {
                "lang": "ml",
                "title": "💰 സകാത്ത്",
                "sub_title": "സമ്പത്തിന്റെ ശുദ്ധീകരണവും കാരുണ്യവും.",
                "desc": "ഇസ്ലാമിന്റെ അഞ്ചു തൂണുകളിൽ ഒന്നാണ് സകാത്ത്. സാമ്പത്തികമായി യോഗ്യരായ മുസ്ലിംകൾ അവരുടെ സമ്പത്തിന്റെ ഒരു നിശ്ചിത ഭാഗം ദരിദ്രർക്കും ആവശ്യമുള്ളവർക്കും നൽകേണ്ടതാണ്. സകാത്ത് സമ്പത്തെ ശുദ്ധീകരിക്കുകയും, അസമത്വം കുറയ്ക്കുകയും, കരുണയുള്ള സമൂഹം നിർമ്മിക്കാനുമാണ് സഹായിക്കുന്നത്."
            }
        ]
    },
    {
        "title": "Sawm",
        "is_primary": true,
        "translations": [
            {
                "lang": "en",
                "title": "🌙 Sawm",
                "sub_title": "Fasting in Islam",
                "desc": "Sawm refers to fasting, one of the Five Pillars of Islam. Muslims abstain from food, drink, and desires from dawn to sunset during the month of Ramadan. It teaches self-control, empathy for the poor, and spiritual closeness to Allah."
            },
            {
                "lang": "ml",
                "title": "🌙 നോമ്പ് (സൗം)",
                "sub_title": "ഇസ്ലാമിലെ ഒരു പ്രധാന തൂണാണ്.",
                "desc": "സൗം അഥവാ നോമ്പ് ഇസ്ലാമിലെ അഞ്ചു തൂണുകളിൽ ഒന്നാണ്. റമളാൻ മാസത്തിൽ മുസ്ലിംകൾ പുലർച്ചെ മുതൽ സൂര്യാസ്തമയം വരെ ഭക്ഷണം, പാനം, ദേഹാഭിലാഷങ്ങൾ എന്നിവയിൽ നിന്ന് വിട്ടുനിൽക്കുന്നു. ഇത് ആത്മനിയന്ത്രണവും, ദരിദ്രരോടുള്ള കരുണയും, അല്ലാഹുവിനോടുള്ള ആത്മീയബന്ധവും വളർത്തുന്നു."
            }
        ]
    },
    {
        "title": "Hajj",
        "translations": [
            {
                "lang": "en",
                "title": "🕋 Hajj",
                "sub_title": "The sacred pilgrimage of Islam.",
                "desc": "Hajj is the annual pilgrimage to Makkah, which is one of the Five Pillars of Islam. It is an obligation for every Muslim who is physically and financially able to perform it at least once in their lifetime. Hajj represents unity, equality, and submission to Allah."
            },
            {
                "lang": "ml",
                "title": "🕋 ഹജ്‌ജ്",
                "sub_title": "ഇസ്ലാമിന്റെ പരിശുദ്ധ തീർത്ഥാടനം.",
                "desc": "ഹജ്‌ജ്‌ ഇസ്ലാമിന്റെ അഞ്ചു അധിസ്ഥാനങ്ങളിൽ ഒന്നാണ്. സാമ്പത്തികവും ആരോഗ്യപരവുമായ കഴിവുള്ള ഓരോ മുസ്ലീവും ജീവിതത്തിൽ കുറഞ്ഞത് ഒരിക്കൽ മക്കയിൽ ഹജ്‌ജ് നിർവഹിക്കേണ്ടത് ബാധ്യതയാണ്. ഹജ്‌ജ്‌ മുസ്ലിംകളുടെ ഐക്യം, സമത്വം, അല്ലാഹുവിനോടുള്ള സമർപ്പണം എന്നിവയെ പ്രതിനിധീകരിക്കുന്നു."
            }
        ]
    }
]
