[
    {
        "title": "Education",
        "translations": [
            {
                "lang": "en",
                "title": "📖 Education",
                "sub_title": "Knowledge is light in Islam.",
                "desc": "Islam gives great importance to education. The first revelation to Prophet Muhammad ﷺ was 'Iqra' (Read). Seeking knowledge is an obligation upon every Muslim, male and female. Both religious and worldly knowledge are important. A Muslim must distinguish between beneficial and harmful knowledge and live life guided by true knowledge."
            },
            {
                "lang": "ml",
                "title": "📖 വിദ്യാഭ്യാസം",
                "sub_title": "ഇസ്ലാമിൽ വിദ്യാഭ്യാസത്തിന് വളരെ വലിയ പ്രാധാന്യമുണ്ട്.",
                "desc": "ഇസ്ലാമിൽ വിദ്യാഭ്യാസത്തിന് വളരെ വലിയ പ്രാധാന്യമുണ്ട്. ആദ്യത്തെ വഹിയ് തന്നെ <strong>\"ഇഖ്‌റ\" (വായിക്കുക)</strong> എന്നതാണ്. അറിവ് നേടുന്നത് ഓരോ പുരുഷനും സ്ത്രീക്കും ബാധ്യതയാണ്. ദീനീ വിഷയങ്ങളായും ലോകപരമായ അറിവുകളായും രണ്ടിനും സമം പ്രാധാന്യമുണ്ട്. നല്ലതും ദോഷമുള്ളതുമായ അറിവുകൾ തമ്മിൽ വ്യത്യാസം തിരിച്ചറിയുകയും, അറിവ് ആധാരമാക്കി ജീവിതം നയിക്കുകയും ചെയ്യേണ്ടത് അനിവാര്യമാണ്."
            }
        ]
    },
    {
        "title": "Life Style",
        "translations": [
            {
                "lang": "en",
                "title": "🧬 Life Style",
                "sub_title": "The Islamic way of living.",
                "desc": "A Muslim’s lifestyle must be based on the Qur’an and the Sunnah of Prophet Muhammad ﷺ. This includes modest clothing, ethical living, maintaining cleanliness, grooming hair and beard, avoiding interest-based transactions, and practicing honesty and humility. The true goal of a Muslim is to live as the Prophet ﷺ lived."
            },
            {
                "lang": "ml",
                "title": "🧬 ജീവിത ശൈലി",
                "sub_title": "ഒരു മുസ്ലിംന്റെ ജീവിത ശൈലി ഖുർആനിന്റെയും നബി (സ) ന്റെ ഹദീസുകളുടെയും അടിസ്ഥാനത്തിലാണ് ആകേണ്ടത്.",
                "desc": "ഒരു മുസ്ലിംന്റെ ജീവിത ശൈലി ഖുർആനിന്റെയും നബി (സ) ന്റെ ഹദീസുകളുടെയും അടിസ്ഥാനത്തിലാണ് ആകേണ്ടത്. വസ്ത്രധാരണം, ശരീഅത്ത് അനുസരിച്ചുള്ള നൈതിക ജീവിതശൈലി, മുടിയും മൂച്ചും ശുദ്ധമായി പരിപാലിക്കൽ, പലിശ അടങ്ങുന്ന സാമ്പത്തിക ഇടപാടുകൾ ഒഴിവാക്കൽ, സത്യവും വിനയവും പാലിക്കൽ തുടങ്ങിയവയിൽ ശ്രദ്ധിക്കണം. നബി (സ) യഥാർത്ഥത്തിൽ എങ്ങനെ ജീവിച്ചു എന്നത് മനസ്സിലാക്കി അതനുസരിച്ച് ജീവിക്കുകയാണ് ഒരു സത്യമായ മുസ്ലിംയുടെ ലക്ഷ്യം."
            }
        ]
    },
    {
        "title": "Marriage",
        "translations": [
            {
                "title": "💍 Marriage",
                "lang": "en",
                "sub_title": "A sacred bond in Islam.",
                "desc": "Marriage (Nikah) is a Sunnah and a strong contract between husband and wife. It protects faith, strengthens family, and ensures a halal way of life."
            },
            {
                "title": "💍 വിവാഹം",
                "lang": "ml",
                "sub_title": "ഇസ്ലാമിലെ ഒരു പരിശുദ്ധ ബന്ധം.",
                "desc": "വിവാഹം (നികാഹ്) ഒരു സുന്നത്തും, ഭർത്താവിനും ഭാര്യക്കും ഇടയിലെ ശക്തമായ ഒരു ഉടമ്പടിയുമാണ്. ഇത് ദീൻ സംരക്ഷിക്കുകയും കുടുംബത്തെ ശക്തിപ്പെടുത്തുകയും, ഹലാൽ ജീവിതം ഉറപ്പാക്കുകയും ചെയ്യുന്നു."
            }
        ]
    },
    {
        "title": "Birth",
        "translations": [
            {
                "title": "👶 Birth",
                "lang": "en",
                "sub_title": "The blessing of new life.",
                "desc": "In Islam, the birth of a child is considered a blessing from Allah. Practices include Adhan in the newborn’s ear, naming with good names, Aqiqah sacrifice, and circumcision for boys."
            },
            {
                "title": "👶 ജനനം",
                "lang": "ml",
                "sub_title": "പുതിയ ജീവന്റെ അനുഗ്രഹം.",
                "desc": "ഇസ്ലാമിൽ ജനനം അല്ലാഹുവിന്റെ അനുഗ്രഹമായി കണക്കാക്കപ്പെടുന്നു. കുട്ടിയുടെ ചെവിയിൽ അദാൻ വിളിക്കുക, നല്ല പേരിടുക, അഖീഖ നിർവഹിക്കുക, ആണ്‍കുട്ടികൾക്ക് ഖത്ത്ന (ഖത്ത്നാന) നടത്തുക തുടങ്ങിയവ പ്രധാനമാണ്."
            }
        ]
    },
    {
        "title": "Celebrations",
        "translations": [
            {
                "title": "🎉 Celebrations",
                "lang": "en",
                "sub_title": "Festivals of joy and worship.",
                "desc": "The two main Islamic celebrations are Eid al-Fitr (after Ramadan) and Eid al-Adha (with Hajj). These are days of worship, joy, family gatherings, charity, and remembrance of Allah."
            },
            {
                "title": "🎉 ആഘോഷങ്ങൾ",
                "lang": "ml",
                "sub_title": "സന്തോഷവും ആരാധനയും നിറഞ്ഞ ദിനങ്ങൾ.",
                "desc": "ഇസ്ലാമിലെ പ്രധാനമായ രണ്ടു ആഘോഷങ്ങൾ: റമളാനിന് ശേഷം വരുന്ന ഈദ് അൽ-ഫിത്വർ, ഹജ്ജിനോടനുബന്ധിച്ചുള്ള ഈദ് അൽ-അദ്ഹാ. ഇവ ആരാധന, സന്തോഷം, കുടുംബസംഗമം, ദാനം, അല്ലാഹുവിനെ സ്മരിക്കൽ എന്നിവ നിറഞ്ഞ ദിനങ്ങളാണ്."
            }
        ]
    },
    {
        "title": "Death",
        "is_primary": true,
        "translations": [
            {
                "title": "🕊️ Death",
                "lang": "en",
                "sub_title": "The inevitable reality of life.",
                "desc": "In Islam, death is a transition to the Hereafter. Washing, shrouding, funeral prayer, and burial must be done as taught by Prophet Muhammad ﷺ. Debts must be cleared, and prayers and charity for the deceased are recommended. Innovations like 3rd, 7th, 40th day rituals must be avoided."
            },
            {
                "title": "🕊️ മരണം",
                "lang": "ml",
                "sub_title": "ജീവിതത്തിലെ അനിവാര്യമായ യാഥാർത്ഥ്യം.",
                "desc": "മരണമെന്നാൽ ഓരോ മുസ്ലിമും അതിനോട് ഇമാനോടെ നേരിടണം. കുളിപ്പിക്കൽ, കഫൻ, ജനാസ നമസ്‌കാരം, ഖബർ അടക്കം തുടങ്ങിയ കാര്യങ്ങൾ നബി (സല്) പഠിപ്പിച്ച രീതിയിൽ ചെയ്യണം. മയ്യിത്തിന്റെ കടം തീർക്കൽ, ദുആ, ഖുർആൻ പാരായണം തുടങ്ങിയവയും പ്രധാനമാണ്. 3, 7, 40, ആണ്ട് ദിവസങ്ങൾ പോലുള്ള ആചാരങ്ങൾ, മൗലിദ് പാരായണവും ഭക്ഷണം വിതരണവും ഒഴിവാക്കണം."
            }
        ]
    },
    {
        "title": "After Death",
        "translations": [
            {
                "title": "⚖️ After Death",
                "lang": "en",
                "sub_title": "The journey of the soul.",
                "desc": "After death, the soul enters Barzakh until the Day of Judgment. Muslims believe in questioning in the grave, resurrection, accountability, and final destiny in Paradise or Hell."
            },
            {
                "title": "⚖️ മരണത്തിന് ശേഷം",
                "lang": "ml",
                "sub_title": "ആത്മാവിന്റെ യാത്ര.",
                "desc": "മരണം കഴിഞ്ഞാൽ ആത്മാവ് ബർസഖിൽ തുടരുന്നു. ഖബറിലെ ചോദ്യം ചെയ്യലും, ഖിയാമത്ത് ദിനത്തിലെ ഉയിർത്തെഴുന്നേൽപ്പും, പ്രവൃത്തികൾക്കനുസരിച്ചുള്ള വിധിയും, സ്വർഗ്ഗമോ നരകമോ ആയ അന്തിമ ലക്ഷ്യവുമാണ് മുസ്ലിം വിശ്വാസം."
            }
        ]
    }
]
