<?php

return [
    // Titles
    "islamic_study_portal"       => "ഇസ്ലാമിക് സ്റ്റഡി പോർട്ടൽ",
    "hadith_books"               => "ഹദീസ് പുസ്തകങ്ങൾ",

    // Menus
    'home'                       => 'ഹോം',
    "quran"                      => "ഖുർആൻ",
    "hadith"                     => "ഹദീസ്",
    "calendar"                   => "കലണ്ടർ",
    "login"                      => "ലോഗിന്",
    "profile"                    => "പ്രോഫൈല്‍",
    "account"                    => "അക്കൗംട്",
    "likes"                      => "ലൈക്സ്",
    "bookmarks"                  => "ബുക്ക്മാർക്കുകൾ",
    "logout"                     => "ലോഗൗട്ട്",

    // Headers
    "home_sub_title"             => "ഈ പോർട്ടൽ വഴി ഇസ്ലാമിക വിദ്യാഭ്യാസം ആഴത്തിൽ പഠിക്കാം",
    "quran_sub_title"            => "ഖുർആൻ ആയത്തുകൾ, അർഥം പഠിക്കാം",
    "hadith_sub_title"           => "ബുഖാരി, മുസ്ലിം, മറ്റു സഹീഹ് ഹദീഥുകൾ",
    "islamic_calendar_sub_title" => "ഇസ്‌ലാമിക് ദിവസങ്ങൾ, റമളാൻ, ഹജ്ജ്",

    // Index page
    "quran_study"                => "ഖുർആൻ പഠനം",
    "islamic_calendar"           => "ഇസ്ലാമിക് കലണ്ടർ",
    "important_topics"           => "പ്രധാനപ്പെട്ട വിഷയങ്ങൾ",

    // Quran Page
    "quran_desc"                 => "മുഹമ്മദ് നബി (സ)യിലൂടെ മനുഷ്യരാശിക്ക് ലഭിച്ച അന്തിമ ദിവ്യ വെളിപാടാണ് ഖുർആൻ. ഇതിൽ 114 സൂറത്തുകൾ (അധ്യായങ്ങൾ) അടങ്ങിയിരിക്കുന്നു, ഓരോന്നും ദൈവിക മാർഗനിർദേശം, നിയമങ്ങൾ, ധാർമ്മികത, കഥകൾ, ജീവിതത്തിനായുള്ള ചിന്തകൾ എന്നിവ വാഗ്ദാനം ചെയ്യുന്നു. ഈ വിശുദ്ധ ഗ്രന്ഥം മാറ്റമില്ലാതെ സംരക്ഷിക്കപ്പെട്ടിട്ടുണ്ട്, കൂടാതെ പ്രകാശത്തിന്റെയും ജ്ഞാനത്തിന്റെയും ഉറവിടമായി തുടരുന്നു.",
    "chapter"                    => "അധ്യായം",
    "ayahs"                      => "ആയത്തുകൾ",

    // Hadith Page
    "chapters"                   => "അധ്യായങ്ങൾ",
    "hadiths"                    => "ഹദീസുകൾ",
    "status"                     => "സ്റ്റാറ്റസ്",
    "volume"                     => "വോളിയം",
    "da`eef"                     => "ദഅീഫ്",
    "sahih"                      => "സഹീഹ്",

    // Answer page
    "quran_revelation"           => "ഖുർആൻ നിർദ്ദേശം",
    "hadith_details"             => "ഹദീസ് വിവരണം",
    "related_questions"          => "ബന്ധപ്പെട്ട ചോദ്യങ്ങൾ",
    "videos"                     => "വിഡിയോകൾ",
    "no_quran_found"             => "ഖുർആൻ വാക്യങ്ങളൊന്നും കണ്ടെത്തിയില്ല.",
    "no_hadith_found"            => "ഹദീസ് വാക്യങ്ങളൊന്നും കണ്ടെത്തിയില്ല.",
    "no_videos_found"            => "വിഡിയോകൾ കണ്ടെത്തിയില്ല.",

    // Calendar Page
    "prayer_times"               => "നമസ്കാര സമയങ്ങൾ",
    "location"                   => "സ്ഥലം",
    "next"                       => "അടുത്തത്",
    "Fajr"                       => "സുബ്ഹ്",
    "Sunrise"                    => "സൂര്യോദയം",
    "Dhuhr"                      => "ളുഹർ",
    "Asr"                        => "അസർ",
    "Maghrib"                    => "മകരിബ്",
    "Isha"                       => "ഇഷാ",

    // Likes Page
    "topics"                     => "വിഷയങ്ങൾ",
    "no_likes_found"             => "നിങ്ങളുടെ ലൈക്കുകൾ ലഭിച്ചില്ല.",

    // Bookmarks Page
    "no_bookmarks_found"         => "നിങ്ങളുടെ ബുക്ക്മാർക്കുകൾ ലഭിച്ചില്ല.",

    // Collection Page
    "my_collections"             => "എന്റെ ശേഖരങ്ങൾ",
    "no_collections_found"       => "എന്റെ ശേഖരങ്ങൾ ലഭിച്ചില്ല.",

    // Share Box
    "share_box_title"            => "ഈ വിവരം മറ്റുള്ളവർക്കും എത്തിക്കൂ.",
    "share_box_desc"             => "ദുആയും നന്മയും മരണപെട്ടതിന് ശേഷവും തുടരാം. നിങ്ങളുടെ ഒരു പങ്കുവെപ്പ് മറ്റൊരാളെ ഓർമ്മിപ്പിക്കാം.",

    // Data
    "loading"                    => "ഡാറ്റ ലോഡ് ചെയ്യുന്നു",
    "not_found"                  => "വിവരം ലഭിച്ചില്ല. ദയവായി മറ്റൊന്ന് ശ്രമിക്കുക",

    // Buttons
    "know_more"                  => "കൂടുതൽ അറിയുക",
    "start_learning"             => "പഠിക്കാൻ തുടങ്ങൂ",
    "view"                       => "കാണുക",
    "view_chapters"              => "അധ്യായങ്ങൾ കാണുക",
    "view_days"                  => "ദിവസങ്ങൾ കാണുക",
    "share"                      => "ഷെയർ ചെയ്യൂ",
];
